lib/xml/deleteFromListFtp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:deleteFromListFtp>
            <!--Optional:-->
            <listName>?</listName>
            <!--Optional:-->
            <deleteSettings>
                <!--Optional:-->
                <allowDataCleanup>?</allowDataCleanup>
                <!--Optional:-->
                <callbackFormat>?</callbackFormat>
                <!--Optional:-->
                <callbackUrl>?</callbackUrl>
                <!--Optional:-->
                <countryCode>?</countryCode>
                <!--Optional:-->
                <failOnFieldParseError>?</failOnFieldParseError>
                <!--Zero or more repetitions:-->
                <fieldsMapping>
                    <columnNumber>?</columnNumber>
                    <!--Optional:-->
                    <fieldName>?</fieldName>
                    <key>?</key>
                </fieldsMapping>
                <!--Optional:-->
                <reportEmail>?</reportEmail>
                <!--Optional:-->
                <separator>?</separator>
                <skipHeaderLine>?</skipHeaderLine>
                <!--Optional:-->
                <listDeleteMode>?</listDeleteMode>
            </deleteSettings>
            <!--Optional:-->
            <ftpSettings>
                <!--Optional:-->
                <hostname>?</hostname>
                <!--Optional:-->
                <password>?</password>
                <!--Optional:-->
                <path>?</path>
                <!--Optional:-->
                <username>?</username>
            </ftpSettings>
        </ser:deleteFromListFtp>
    </soapenv:Body>
</soapenv:Envelope>